# Сектора с точками мониторинга
LOCATIONS_C_sector = {
    "Высота 540": "43.6823590,40.2338643",
    "Высота 960": "43.6687575,40.2382059",
    "Высота 1500 Реликтовый лес": "43.6582897,40.2531690",
    "Высота 2200 Смотровая": "43.6460017,40.2518081",
    "Высота 2050 Цирк 2": "43.6436585,40.2555860",
    "Высота 2300 Черная пирамида": "43.642015,40.262765"
}

LOCATION_East_sector = {
    "Высота 1000 Восточный лес": "43.663628,40.264331",
    "Высота 1370 К13 В.Поликаря": "43.656790,40.267842"
}

# Все локации объединенные
ALL_LOCATIONS = {**LOCATIONS_C_sector, **LOCATION_East_sector}

# Сектора для меню
SECTORS = {
    "Центральный сектор": LOCATIONS_C_sector,
    "Восточный сектор": LOCATION_East_sector,
    "Все точки": ALL_LOCATIONS
}

# Настройки оповещения
ALERT_WINDOW = 2  # Часов для предупреждения о грозе
CHECK_INTERVAL = 1800  # 30 минут между проверками