# bot/config.py
from typing import Dict

# Сектора с точками мониторинга
LOCATIONS_C_SECTOR: Dict[str, str] = {
    "Высота 540": "43.6823590,40.2338643",
    "Высота 960": "43.6687575,40.2382059",
    "Высота 1500 Реликтовый лес": "43.6582897,40.2531690",
    "Высота 2200 Смотровая": "43.6460017,40.2518081",
    "Высота 2050 Цирк 2": "43.6436585,40.2555860",
    "Высота 2300 Черная пирамида": "43.642015,40.262765"
}

LOCATION_EAST_SECTOR: Dict[str, str] = {
    "Высота 1000 Восточный лес": "43.663628,40.264331",
    "Высота 1370 К13 В.Поликаря": "43.656790,40.267842"
}

# Все локации объединенные
ALL_LOCATIONS: Dict[str, str] = {**LOCATIONS_C_SECTOR, **LOCATION_EAST_SECTOR}

# Настройки оповещения
ALERT_WINDOW: int = 2  # Часов для предупреждения о грозе
CHECK_INTERVAL: int = 1800  # 30 минут между проверками

# Коды погоды для грозы
THUNDERSTORM_CODES: list = [1087, 1273, 1276, 1279, 1282]